# План занятия 22.11.2019

## Повторение

### списки (list)

```python
# создание списка
a = [1, 2, 3, 4, 5]
b = [1, '2', 3.0, True, None]

# обращение к элементам списка
print(a[0])
print(a[-1])
print(a[1:3])

# изменение элементов списка
a[0] = 10
print(a)

# добавление элементов в список
a.append(6)
print(a)

# удаление элементов из списка
del a[0]
print(a)
```

### кортежи (tuple)

```python
# создание кортежа
a = (1, 2, 3, 4, 5)
b = (1, '2', 3.0, True, None)

# обращение к элементам кортежа
print(a[0])
print(a[-1])
print(a[1:3])

# изменение элементов кортежа
# кортеж неизменяемый
```

### словари (dict)

```python
# создание словаря
a = {'a': 1, 'b': 2, 'c': 3}

# обращение к элементам словаря
print(a['a'])
print(a['b'])
print(a['c'])

# изменение элементов словаря
a['a'] = 10
print(a)

# добавление элементов в словарь
a['d'] = 4
print(a)

# удаление элементов из словаря
del a['a']
print(a)
```

### множества (set)

```python
# создание множества
a = {1, 2, 3, 4, 5}
b = {1, '2', 3.0, True, None}

# обращение к элементам множества
# множество неупорядоченное
# нет индексации
# нет срезов
# нет обращения по ключу

# добавление элементов в множество
a.add(6)
print(a)

# удаление элементов из множества
a.remove(6)
print(a)
```

## Функции

### Определение функции

```python
def func():
    print('Hello, world!')

func()
```

### Параметры функции

```python
def func(a, b):
    print(a + b)

func(1, 2)
func('1', '2')
func([1, 2], [3, 4])
```

### Возвращаемое значение функции

```python
def func(a, b):
    return a + b

print(func(1, 2))
print(func('1', '2'))
print(func([1, 2], [3, 4]))
```


## Обзор программ

### Из домашнего задания написать программу, которая:
  - [ ] Телепортирует игрока в определенную точку
  - [ ] В этой точке игроку нужно будет найти блок песка(или любого другого) за 30 секунд (пример 6-iron.py и 6-waterlemon.py)
  - [ ] Если игрок не нашел блок, то он телепортируется обратно. Если нашел, то игроку начисляются очки.
  - [ ] После этого игроку предлагается сыграть еще раз или выйти из игры.

## Практическое задание

### Улучшить игру, которая представлена выше
- [ ] Добавить возможность играть несколько раз
- [ ] Добавить выбора блока через консоль
- [ ] Добавить возможность выбора времени на поиск блока через консоль
- [ ] Написать игру, где нужно пройти через препятствия (пример 7-test.py) и найти блок (пример hw-solve-hit.py)