# Темы

- Что такое функция
- Как создать функцию
- Как вызвать функцию
- Передача аргументов в функцию
- Возвращение значения из функции

## Что такое функция

Функция - это набор инструкций, которые выполняют определенную задачу. Функции позволяют повторно использовать код, а
также упрощают его чтение и понимание.

## Как создать функцию

Для создания функции используется ключевое слово `def`, после которого идет имя функции, круглые скобки и двоеточие.
Внутри функции можно писать любой код, который будет выполняться при вызове функции.

Тут мы создали функцию `say_hello`, которая выводит на экран строку `Hello!`.

```python
def say_hello():
    print('Hello!')
```

А тут мы создали функцию, которая считывает с клавиатуры два числа и выводит их сумму.

```python
def read_and_sum():
    a = int(input())
    b = int(input())
    print(a + b)
```

Что делает эта функция?
Как её лучше назвать?

```python
def f():
    a = int(input())
    b = int(input())
    if a > b:
        print(a)
    else:
        print(b)
```

А что скажете про эту функцию?

```python
def f():
    while True:
        a = int(input())
        if a == 0:
            break
        if a % 2 == 0:
            print(a)
```

## Как вызвать функцию

Что значит вызвать функцию? Это значит выполнить её код в том месте, где она была вызвана.

```python
def say_hello():
    print('Hello!')


say_hello()
```

```python
def read_and_sum():
    a = int(input())
    b = int(input())
    print(a + b)


read_and_sum()
```

### Полезный пример

Например, нам надо написать программу, которая будет считывать имя пользователя и выводить на экран приветствие.

```python
name = input()
print('Hello, ' + name + '!')
```

Но что, если нам надо будет считывать не одно имя, а несколько? Мы можем просто скопировать код и вставить его несколько
раз.

```python
name = input()
print('Hello, ' + name + '!')
name = input()
print('Hello, ' + name + '!')
name = input()
print('Hello, ' + name + '!')
```

Но это не очень хорошее решение, потому что если нам надо будет считывать 1000 имен, то придётся копировать и вставлять
код 1000 раз.

Поэтому лучше написать функцию, которая будет считывать имя и выводить на экран приветствие.

```python
def say_hello():
    name = input()
    print('Hello, ' + name + '!')
```

А теперь мы можем вызывать эту функцию столько раз, сколько нам надо.

```python
for i in range(5):
    say_hello()
```

## Передача аргументов в функцию

Функция может принимать аргументы. Аргументы - это переменные, которые передаются в функцию при её вызове.

Зачем нужны аргументы? Для того чтобы функция могла работать с разными данными.

Аргументы передаются в функцию через запятую после имени функции.

Например, мы хотим написать функцию, которая будет выводить на экран площадь прямоугольника. Площадь прямоугольника
вычисляется по формуле `S = a * b`, где `a` - длина, `b` - ширина.

```python

def print_square(a, b):
    print(a * b)
```

Теперь мы можем вызывать эту функцию с разными аргументами.

```python
print_square(2, 3)
print_square(5, 10)
print_square(100, 100)
```

## Возвращение значения из функции

Функция может просто выполнять действия, но она может и возвращать значение.

Это значит, что после выполнения функции мы можем получить результат её работы.

Чтобы функция возвращала значение, нужно использовать ключевое слово `return`.

После того как выполнение функции дойдёт до `return`, она завершится и вернёт значение, которое указано после `return`.

Например, мы хотим написать функцию, которая будет вычислять площадь прямоугольника. А потом не выводить её на экран, а
вернуть результат.

```python
def get_square(a, b):
    return a * b
```

Теперь мы можем вызывать эту функцию с разными аргументами и получать результат.

```python
print(get_square(2, 3))
print(get_square(5, 10))
print(get_square(100, 100))
```

или сохранять результат в переменную и потом уже использовать её.

```python
square1 = get_square(100, 100)
square2 = get_square(200, 200)
```

## Проверка знаний

### Теория

1. Что такое функция?
2. Как объявить/создать функцию?
3. Как вызвать функцию?
4. Что такое аргументы функции?
5. Что такое возвращаемое значение функции?
6. Как вернуть значение из функции?
7. Как можно использовать возвращаемое значение функции?

### Практика

#### Условия

- Создайте в проекте в PyCharm папку на сегодняшний урок по типу `lesson_function_Marsel`.
- Для каждой задачи создайте отдельный файл с названием `task_1.py`, `task_2.py` и т.д.
- В каждом файле решите задачу и запустите её.

- Чтобы получить **10** кодкоинов, нужно выполнить **5** заданий и написать для них проверочные **тесты**.
- При выполнении всех заданий, можно получить **20** кодкоинов.

#### Задачи

1. Написать функцию `my_sum`, которая принимает на вход два числа и возвращает их сумму.
    - Например, `my_sum(1, 2)` должно вернуть `3`.
2. Написать функцию, которая принимает на вход два числа и возвращает наименьшее из них.
    - Например, `my_min(1, 2)` должно вернуть `1`.
3. Напишите функцию, которая принимает строку и узнаёт сколько в ней букв `a`.
    - Например, `count_a("apple")` должно вернуть `1`.
4. Напишите функцию, которая принимает строку и символ и возвращает сколько раз этот символ встречается в строке.
    - Например, `count_symbol("apple", "p")` должно вернуть `2`.
5. Напишите функцию, которая получает список чисел и возвращает `True`, если в списке есть хотя бы одно чётное число,
   и `False` в противном случае.
    - Например, `has_even([1, 3, 5])` должно вернуть `False`.
    - Например, `has_even([1, 2, 3])` должно вернуть `True`.
6. Напишите функцию, которая получает список чисел и возвращает `True`, если в списке есть хотя бы одно число, которое
   делится на 3,
   и `False` в противном случае.
    - Например, `has_divisible_by_3([1, 2, 4])` должно вернуть `False`.
    - Например, `has_divisible_by_3([1, 2, 3])` должно вернуть `True`.
7. Напишите функцию, которая получает строку и возвращает `True`, если строка начинается с заглавной буквы,
   и `False` в противном случае.
    - Например, `starts_with_upper("Hello")` должно вернуть `True`.
    - Например, `starts_with_upper("hello")` должно вернуть `False`.
    - Чтобы проверить, что строка начинается с заглавной буквы, можно воспользоваться функцией `str.isupper()`.
    - Например, `"Hello".isupper()` вернёт `True`, а `"hello".isupper()` вернёт `False`.

## Домашняя работа

### Условия
- Отправлять решения нужно в текстовом формате (возможно, позже формат будет изменён).
- За выполнение всех заданий можно получить 1 балл.

### Задание 1

Напишите функцию `get_mean`, которая принимает на вход три числа и возвращает среднее арифметическое этих чисел.

Среднее арифметическое - это сумма всех чисел, делённая на их количество.

Например, `get_mean(1, 2, 9)` должно вернуть `4`.

#### Тесты
 
`get_mean(1, 2, 3)` должно вернуть `2`.

`get_mean(1, 2, 9)` должно вернуть `4`.

`get_mean(1, 2, 0)` должно вернуть `1`.

`get_mean(1, 2, -3)` должно вернуть `0`.


### Задание 2

Напишите функцию `get_mean_list`, которая принимает на вход список чисел и возвращает среднее арифметическое этих чисел.

Например, `get_mean_list([1, 2, 9])` должно вернуть `4`.

#### Тесты

`get_mean_list([1, 2, 3])` должно вернуть `2`.

`get_mean_list([1, 2])` должно вернуть `1.5`.

`get_mean_list([1, 2, 10, -12, 8])` должно вернуть `1.4`.

`get_mean_list([1])` должно вернуть `1`.

`get_mean_list([])` должно вернуть `0`.

