# Темы

- Цикл while
- Цикл for
- Создание консольной игры

## Проверка знаний

1. Что такое условия if, if-else, if-elif-else?
2. Что такое логические операторы?
3. Какие типы данных есть в Python?
4. Какие функции перевода типов данных есть в Python?

## Цикл while

Цикл ```while``` в Python используется для повторения какого-либо блока кода, пока выполняется условие.

В Python цикл while имеет следующий синтаксис:

```python
while условие:
    блок
    кода
```

### Примеры

Вывод чисел от 1 до 10, через одно:

```python       
i = 1
while i <= 10:
    print(i)
    i += 2
```

Вывод чисел от 1 до 100 кратных 7:

```python

i = 1
while i <= 100:
    if i % 7 == 0:
        print(i)
    i += 1
```

Вывод чисел до бесконечности:

```python
i = 1
while True:
    print(i)
    i += 1
```

Вывод чисел, пока пользователь не введет 0:

```python
while True:
    number = int(input())
    if number == 0:
        break
    print(number)
```

или

```python
a = int(input())
while a != 0:
    print(a)
    a = int(input())
```

## Цикл for

Цикл ```for``` в Python используется для повторения какого-либо блока кода определенное количество раз.

В Python цикл ```for``` имеет следующий синтаксис:

```python
for переменная in последовательность:
    блок
    кода
```

На самом деле ```for``` перебирает последовательность, а не переменную.

Например, если мы хотим вывести все элементы списка, то мы можем написать так:

```python
a = ['Привет', 1, 'Мир', 100]
for i in a:
    print(i)
```

Если мы хотим повторить какой-то блок кода определенное количество раз, то мы можем использовать функцию ```range()```.

```python
for i in range(10):
    print(i)
```

А можем вывести все элементы списка по индексу:

```python
a = ['Привет', 1, 'Мир', 100]
for i in range(len(a)):
    print(a[i])
```

#### Подумайте, как отличаются примеры выше?

При этом ```range(10)``` будет генерировать последовательность чисел от 0 до 9.

### Подробнее про range()

Функция ```range()``` может принимать 3 аргумента:

```python
range(start, stop, step)
```

- ```start``` - начало последовательности
- ```stop``` - конец последовательности
- ```step``` - шаг последовательности
- ```start``` и ```step``` - необязательные аргументы
- ```stop``` - обязательный аргумент
- ```start``` по умолчанию равен 0
- ```step``` по умолчанию равен 1
- ```stop``` не входит в последовательность
- ```start``` и ```stop``` должны быть целыми числами

Рассмотрим примеры:

```python
for i in range(10):
    print(i)
```

Выведет числа от 0 до 9.

```python
for i in range(1, 10):
    print(i)
```

Выведет числа от 1 до 9.

```python
for i in range(1, 10, 2):
    print(i)
```

Выведет числа от 1 до 9 с шагом 2.

```python
for i in range(10, 0, -1):
    print(i)
```

Выведет числа от 10 до 1 с шагом -1.

```python
for i in range(10, 0, -2):
    print(i)
```

Выведет числа от 10 до 1 с шагом -2.

## Циклы в циклах

Мы можем использовать циклы в циклах.

 ```python
 for i in range(10):
    for j in range(10):
        print(i, j)
 ``` 

Выведет все возможные комбинации чисел от 0 до 9.

## Задачи на for range()

1. Напишите программу, которая выводит на экран числа от 1 до 100.
2. Напишите программу, которая выводит на экран числа от 100 до 1.
3. Напишите программу, которая выводит на экран числа от 50 до 100 с шагом 3.
4. Напишите программу, которая выводит все четные числа от 1 до 100.
5. Напишите программу, которая выводит все нечетные числа от `a` до `b` (значения `a` и `b` вводятся с клавиатуры).

## Задачи на while

1. Напишите программу, которая будет спрашивать у пользователя число, пока он не введет число 5.
2. Напишите программу, в которой пользователь вводит несколько чисел, их
   количество не известно. Числовая последовательность
   завершается числом 0. Найдите количество введенных чисел.
3. Найдите сумму чисел, введенных в предыдущей
   задаче.
    - для решения
      задачи нужно ввести еще одну переменную, в которую будет
      записываться сумма.

## Задачи на for

1. Напишите программу, которая выводит на экран все элементы списка.

## Задачи на двойные циклы

1. Напишите программу, которая выводит на экран таблицу умножения от 1 до 10 в виде:

    ```
    1 * 1 = 1
    1 * 2 = 2
    1 * 3 = 3
    2 * 1 = 2
    2 * 2 = 4
    2 * 3 = 6
    3 * 1 = 3
    3 * 2 = 6
    3 * 3 = 9
   ...
   10 * 9 = 90
   10 * 10 = 100
    ```

## Игра "Угадай число"

Напишите программу, которая загадывает случайное число от 1 до 100 и
предлагает пользователю его отгадать.

Пользователь вводит число, а программа отвечает, больше ли оно, чем загаданное, или меньше.

После того как пользователь угадает число, программа должна вывести количество
попыток, за которое пользователь угадал число.

#### Подсказка

Для генерации случайного числа используйте функцию `random.randint(1, 100)`.

```python
import random

number = random.randint(1, 100)
# тут ваш код
```

## Домашнее задание

- Написать решения, для всех задач, которые указаны в этом уроке (0.5 балла за все)
- Написать решение для задачи "Угадай число" (0.5 балла)
- Решения отправлять в телеграм