# читаем число, введённое пользователем
n = int(input())
# создаём флаг - переменную, которая будет 1, если что-то выполнено; иначе 0
flag = 0
# счётчик пробегает n чисел
for i in range(n):
    # читаем новое число с экрана
    number = int(input())
    # если число отрицательное (меньше 0), то печатаем на экран, что такое есть
    if number < 0:
        print("есть отрицательное число!")
        flag = 1
        break

if flag == 0:
    # если break не сработал, то есть, если флаг всё ещё 0, печатаем "отрицательных чисел нет"
    print("отрицательных чисел нет")
