# подключаемся к Майнкрафту
from mcpi.minecraft import Minecraft

mc = Minecraft.create()

# присваиваем переменным x,y,z значения координат
x = -20
y = 100
z = 160
# заполняем переменные ширины, высоты и длины
width = 20
height = 40
length = 20
# 4 - идентификатор булыжника, 0 - идентификатор воздуха
blockType = 4
air = 0

# ставим блоки для параллелепипеда
mc.setBlocks(x, y, z, x + width, y + height, z + length, blockType)

# заполняем внутренность воздуха - обе вершины смещаем по направлению друг к другу
# по всем 3 координатным осям - нам нужно, чтобы стены, потолок и пол остались нетронутыми
# у (x,y,z) значения меньше, чем координаты другой точки, так как
# ширина, высота и длина больше нуля
# поэтому к (x,y,z) мы прибавляем по 1, а из координат другой точки вычитаем
mc.setBlocks(x + 1, y + 1, z + 1, x + width - 1, y + height - 1, z + length - 1, air)
