# подключаем команды для редактирования мира Майнкрафта
from mcpi.minecraft import Minecraft

mc = Minecraft.create()

# спрашиваем и вводим координаты точки в майнкрафте
x = int(input("Введите x-координату: "))
y = int(input("Введите y-координату: "))
z = int(input("Введите z-координату: "))

# бесконечный цикл
while True:
    string = input()
    if string == "где я?":  # если введённая пользователем строчка - вопрос "где я?"
        pos = mc.player.getPos()
        cx, cy, cz = pos.x, pos.y, pos.z  # кладём в другие переменные позицию игрока
        r = 0  # это результат, туда положим количество шагов - необходимый ответ
        # все if'ы необходимы - мы смотрим, в каком порядке нужно вычитать координаты
        # и добавляем количество шагов в результат
        if cx > x:
            r += cx - x
        else:
            r += x - cx
        if cy > y:
            r += cy - y
        else:
            r += y - cy
        if cz > z:
            r += cz - z
        else:
            r += z - cz
        # выводим на экран и печатаем в чат необходимое количество шагов
        print(r)
        mc.postToChat(r)
